Rails-Models-and-Databases/mandd/app/controllers/main_controller.rb

SELECT "jokes".* FROM "jokes"
---
    def index
        @jokes = Joke.all

SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: Joke.find(params[:id])

SELECT "jokes"."jktype" FROM "jokes"
---
    def types
        @jktypes = Joke.select(:jktype)
        render json: @jktypes.map { |jkt| jkt[:jktype] }.uniq

SELECT "jokes".* FROM "jokes" WHERE "jokes"."jktype" = ?  [["jktype", "3"]]
---
    def showtype
        @jkts = Joke.where(jktype: params[:jkt])